# ExternallyTaggedGeometryObject Class

---
Base class for ExternallyTaggedGeometryObject and ExternallyTaggedSolid.
SystemObject Autodesk.Revit.DBExternallyTaggedGeometryObject Autodesk.Revit.DBExternallyTaggedBRep Autodesk.Revit.DBExternallyTaggedNonBRep
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ExternallyTaggedGeometryObject : IDisposable

    Public Class ExternallyTaggedGeometryObject
    	Implements IDisposable

    public ref class ExternallyTaggedGeometryObject : IDisposable

    type ExternallyTaggedGeometryObject =
        class
            interface IDisposable
        end
The ExternallyTaggedGeometryObject type exposes the following members.
| Name| Description
---|---|---
| ExternalId|  The external Id of the geometry object.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ExternallyTaggedGeometryObject
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace